# LayerElemThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerElemThickness Property
ParameterTypeId Class See Also
---
"Thickness": Thickness
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerElemThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerElemThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerElemThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace